sharing-coupons-api/app/controllers/coupons_controller.rb

    def index
        coupons = Coupon.all
---
SELECT "coupons".* FROM "coupons"

    def show
        coupon = Coupon.find_by(params[:id])
---
SELECT "coupons".* FROM "coupons" WHERE (stores) LIMIT ?  [["LIMIT", 1]]

    def create
        newCoupon = Coupon.create(code: params['code'], offer_type: params['offerType'], description: params['description'], expiration_date: params['expirationDate'], store_id: params['storeId'])
---
INSERT INTO "coupons" ("code", "offer_type", "description", "expiration_date", "store_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)