sharing-coupons-api/app/controllers/stores_controller.rb

    def index
        stores = Store.all
---
SELECT "stores".* FROM "stores"

    def create
        newStore = Store.create(name: params['name'], website: params['website'])
---
INSERT INTO "stores" ("name", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Trader Joe's"], ["website", "https://www.traderjoes.com/"], ["created_at", "2020-03-17 23:58:53.860972"], ["updated_at", "2020-03-17 23:58:53.860972"]]